package Day0621;

public class WhileTest_01 {

	public static void main(String[] args) {
		// 반복문 
		/* 
		1. for(초기값;조건식;증감식) {
			문장; => 	조건이 참이 될때까지 반복 실행 
		}
		==> 반복횟수가 정해져있는 경우 많이 사용(예: 배열)
		
		2. while(조건식){
			문장; =>조건이 참이 될때까지 반복 실행.. 조건이 안맞으면 한번도 실행안함(선조건)
		}
		==> 
			
		3. do{
			문장; 	
		}while(조건식);
		=> do-while문은 조건이 참이 될때까지 반복 실행.. 조건이 안맞아도 한번은 실행함(후조건)	
		
		4. break; ==> 반복문에서 빠져나갈때 	
			=> 현재속한 반복문을 빠져나간다.
			break label:
				:label이 선언된 반복문을 빠져나온다.(한꺼번에 두개 이상도 탈출 가능하다.) 
		5. continue; ==> 반복문에서 다시 진행. 즉, skip하는 것.
			=> 반복문에서 continue를 만나면 다음 코드를 실행하지 않고, 조건식(while), 증감식(for)문으로 이동한다. 	
*/
		
		
		
	}

}
